[
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1 - Singapore International Trade",
    "description": "A data visualization makeover and a Tableau tutorial for beginners.",
    "author": [
      {
        "name": "Ryan Chan",
        "url": "https://www.linkedin.com/in/ryan-chan-a7021b5/"
      }
    ],
    "date": "2021-05-29",
    "categories": [],
    "contents": "\r\n1.0 ORIGINAL VISUALIZATION\r\n The above chart shows a visualization depicting merchandising trade of the top six trading countries from 2019-2020. The data is available at https://www.singstat.gov.sg/find-data/search-by-theme/trade-and-investment/merchandise-trade/latest-data, and can be downloaded from the Merchandise Trade by Region/Market section under ‘Download all in Excel’.\r\nBefore we analyse the visualization, it is important to gain a clear understanding of the context of the visualization and the data it represents.\r\nData is meant to represent Singapore’s trade values (Exports and Imports) with its top six trading partners\r\nVisualization is indicated by the title to be from 2019 to 2020\r\nBoth the visualization and underlying data source do not indicate the currency in which these trade values are published, hence for the purposes of this project we shall make the assumption of values being in Singapore dollars, reasonable given that the data comes from a government agency\r\n2.0 CRITIQUE OF VISUALIZATION\r\n2.1 Clarity\r\nThe chart title is not very clear; a first-time reader might misidentify the visualization to be about the total value of international trade that each of the countries conducted, and that these six countries represent the top six countries in the world in terms of trade value. Instead the data is referring to value of trade each country conducts with Singapore, and that these countries represent Singapore’s top six trading partners.\r\nThe title states that the period of data the visualization is meant to display is from 2019 to 2020. That itself is not clear; should we take it to mean from Jan 2019 to Jan 2020, or perhaps Jan 2019 to Dec 2020? For this project however, we shall assume a consistent period range of Jan 2019 to Dec 2020 for all values.\r\nFurthermore, the horizontal axes of the six charts have different ranges, with Japan seemingly having a range that only covers 2020.\r\n\r\nThe vertical axes for the six charts are all in different ranges, making it hard to compare between countries.\r\nThe visualization intends to depict trade values over months, but using an area-type chart which makes it hard to tell the values of each month, and identify which months have specific trends (e.g. spikes, troughs).\r\nThe chart does not explicitly state the denomination of the values shown, and readers might be misled into thinking that the trade volumes range from a few hundred thousand to a few million. Yet, upon closer inspection of the underlying data source, the values are actually given in denominations of thousands ($000s) and actual trade volumes range from a few hundred million to billions.\r\n2.2 Aesthetics\r\nThe width size of each chart are different from each other, making the visual not aesthetically balanced.\r\nThe positioning of the charts does not make it easy for country-to-country comparison – they are too far apart and having 3 countries on top and 3 countries below is not ideal for comparison.\r\nThe use of overlapping area charts with the orange import overlaid on the blue export values makes it not too pleasing on the eyes, it might take reader’s eyes a while to adjust to finding the blue values especially when they are ‘hidden’ behind the orange area.\r\n3.0 PROPOSED ALTERNATIVE DESIGN\r\n\r\n3.1 Advantages of New Design\r\nTitle changed to better reflect the objective and period range of the visualization. Subtitle added to include a short summary of key findings.\r\nChart type changed to bar chart, to enable ease of month-to-month comparisons.\r\nSeparated export and import trade values, with import values displayed in a reverse (upside-down) manner, to enable easier-on-the-eye comparison between the magnitudes of export and import volumes.\r\nTo ease country-to-country comparison, certain changes were made:\r\nCharts are placed side by side each other on the same level\r\nHorizontal axes and chart width were standardized\r\nVertical axes standardized to 0 to 8 billion\r\n\r\nFor each chart (export and import), categorise values into two types – if an export / import value is higher than its export / import counterpart in the same month, that value will contain a darker shade of the colour scheme used. This enables reader to easily identify in which months Singapore had more net exports or imports for each of their trading partners.\r\nIncluded additional information on trade totals:\r\nAggregated totals of export and import trade volumes in the period range\r\nCalculated export and import differences to find out whether Singapore has trading surpluses or deficits with each trading partner\r\n\r\n4.0 DATA PREPARATION\r\nThe data was first cleaned and prepared using Tableau Prep Builder and then loaded into and visualized using Tableau.\r\n4.1 Importing Data\r\nCreate a connection to the data source.\r\nDrag the tables (T1 and T2) to edit into the canvas to start their respective flows. From this point onwards, both tables shall be handled in the same manner until the moment they are joined.\r\nTick the ‘Use Data Interpreter’ check box.\r\n\r\nTableau’s Data Interpreter will try its best to figure out the underlying table structure in each worksheet. The result of cleaning with Data Interpreter are as follows:\r\nOriginal\r\n\r\nAfter Data Interpreter is Used\r\n\r\n4.2 Pivoting Data\r\nClick on the ‘+’ sign beside the table and select ‘Pivot’\r\nOn the left panel, select all fields except ‘Subject: Merchandise Trade’ and drag them to the ‘Pivoted Fields’ pane.\r\n\r\nAfter pivoting the relevant fields, add another step to ‘clean’ data.\r\n\r\n4.3 Cleaning Data\r\nRename the fields accordingly\r\nCreate a calculated field to derive the actual value of each row\r\n\r\nFilter for the six countries we want\r\n\r\nConvert the ‘Year Month’ field into a date time format\r\n\r\nFilter for the time period we want.\r\n\r\n4.4 Joining Data\r\nAdd a new step to join the two cleaned tables.\r\nUnder settings, apply two join clauses: Period and Country. Output should be a total of 144 resulting rows.\r\n\r\nCreate an additional clean step.\r\nRemove duplicated fields\r\nCreate 2 additional fields to indicate if i) Exports > Imports and ii) Imports > Exports (this will be used to supplement the visualization in Tableau later on)\r\n\r\n\r\n4.5 Run Output Flow\r\nAdd an Output step and click ‘Run Flow’ to save the data as a Tableau Data Extract (.hyper)\r\n\r\n5.0 DATA MAKEOVER WITH TABLEAU\r\n5.1 Makeover Original Chart\r\n5.1.1 Importing Data into Tableau\r\nLaunch Tableau Desktop, and under the ‘Connect To a File’ section select ‘More’. Navigate to the Tableau Data Extract file we have just saved.\r\n\r\nRename ‘Sheet 1’ to ‘Main’. Navigate to ‘Main’ to begin makeover. Result of the connection will look like this:\r\n\r\n5.1.2 Create Chart\r\nDrag ‘Country’ and ‘Period’ into ‘Columns’ shelf. Click on the dropdown arrow on the ‘Period’ icon and select the second ‘Month’ option to drill down the period display into months.\r\n\r\nDrag the ‘Export’ and ‘Import’ measures into the ‘Rows’ shelf. The default chart displayed is a line chart. Under the ‘All’ section in the ‘Marks’ shelf, select the dropdown menu to change chart type to ‘Bar’.\r\n\r\nFor both Import and Export axes, right-click on each axis and perform the following actions:\r\nSet fixed range – Fixed Start: 0, Fixed End: 8,000,000,000\r\nRename Axis Title – Export / Import ($SGD)\r\nFor Import Axis only: Check the ‘Reversed’ box\r\n\r\n\r\n5.1.3 Colourize Chart\r\nUnder the ‘SUM(Export)’ mark, drag the ‘Export > Import?’ measure into the ‘Color’ box, repeat the steps for the ‘SUM(Import)’ mark using the ‘Import > Export?’ measure.\r\n\r\nUnder the colour legend, click the dropdown arrow and select ‘Edit Colors’.\r\n\r\nIn the ‘Edit Colors’ settings, we will edit the colours of the bars.\r\nFor the Import data, we will use the orange colour scheme, with a darker shade to represent months where imports exceed exports, and a lighter shade to represent months where the imports are less than exports.\r\nFor the Export data, we will use the green colour scheme, with a darker shade to represent months where exports exceed imports, and a lighter shade to represent months where the exports are less than imports.\r\n\r\nThe result will look something like this:\r\n\r\n5.1.4 Edit Title\r\nChange the title and add subtitle to better reflect the summary and objectives of the visualization\r\n\r\n5.2 Create Totals Table\r\nWe will now create a table to display Singapore’s total trade volumes with each of their trading partners over the selected period.\r\n5.2.1 Create new sheet and new calculated field\r\nCreate new sheet and rename to ‘Totals’.\r\nIn the ‘Tables’ section right-click and select ‘Create Calculated Field’. Create a new calculation showing the difference between Export and Import (i.e. Export-Import).\r\n\r\n5.2.2 Select Relevant Data to Display\r\nDrag ‘Country’ and ‘Period’ into ‘Columns’ shelf.\r\nDrag ‘Measure Values’ into the ‘Text’ box under the ‘Marks’ shelf.\r\nClick on the dropdown arrow of each of the ‘Measure Values’ and format number to show the currency and numbers in Billions with 1 decimal place.\r\n\r\nDrag ‘Measure Names’ into the ‘Rows’ shelf.\r\nDelete ‘CNT(Extract)’ from the ‘Measure Values’ shelf.\r\nDrag ‘Measure Values’ into the ‘Color’ box under the ‘Marks’ shelf.\r\nUnder the ‘Analysis’ toolbar, navigate to ‘Totals’ and select ‘Show Row Grand Totals’.\r\nRearrange the values so that ‘SUM(Difference)’ is at the bottom. Result will look like this:\r\n\r\n5.2.3 Editing the Colour scheme for table data\r\nClick on the dropdown arrow of ‘Measure Values’ with the colour icon, and select ‘Use Separate Legends’.\r\n\r\nUnder the colour legend on the right-hand side of the window, click the dropdown arrow of ‘SUM(Export)’ and select ‘Edit Colors’. In the ‘Edit Colors’ settings, we will edit the colours for the Export and Import values.\r\nSelect ‘Custom Diverging’ from the ‘Palette’ dropdown list. Check the ‘Stepped Color’ option and change to 2 steps. Change both colours on the left and right side of the palette to black. Check ‘Include Totals’ box. Click ‘Apply’ and then ‘OK’. Click the dropdown arrow for ‘SUM(Exports)’ colour legend and select ‘Hide Card’.\r\nRepeat steps for ‘SUM(Import)’ colour legend.\r\n\r\nUnder the colour legend on the right-hand side of the window, click the dropdown arrow of ‘SUM(Differences)’ and select ‘Edit Colors’. In the ‘Edit Colors’ settings, we will edit the colours for the Difference values.\r\nSelect ‘Custom Diverging’ from the ‘Palette’ dropdown list. Check the ‘Stepped Color’ option and change to 2 steps. Change the left side to red and the right side to green. Click ‘Advanced’ option and tick the ‘Center’ box and type in 0. Check ‘Include Totals’ box. Click ‘Apply’ and then ‘OK’. Click the dropdown arrow for ‘SUM(Difference)’ colour legend and select ‘Hide Card’.\r\n\r\nRename table to ‘Trade Totals’. Result table will look like this:\r\n\r\nRight-click anywhere on the canvas and click ‘caption’. A caption should appear at the bottom of the canvas. Double-click on the caption window and edit the caption to show the source of data.\r\n\r\n5.3 Create Dashboard and Combine Charts\r\nIn the pages tab at the bottom of the window, click ‘New Dashboard’ icon to open up a new dashboard.\r\n\r\nUnder the ‘Size’ options, select ‘Automatic’.\r\n\r\nDrag and drop both the ‘Main’ and ‘Totals’ sheet into the windows, with the ‘Main’ sheet above and ‘Totals’ sheet below. Right-click on any blank space in the ‘Trade Totals’ sheet and select the ‘Caption’ option. Realign the data tables from both sheets accordingly so they align together nicely. The result should look something like this:\r\n\r\nVoila! We have created our first dashboard! Visit this link to access the dashboard on Tableau Public: Tableau Public Dashboard\r\nMajor Observations\r\n\r\nOver the selected period, we can observe that, except for a few months, we can see a relatively clear trend of Mainland China consistently ranking as Singapore’s top trading partner in terms of trade volumes for both exports and imports.\r\nHong Kong’s entry into the top six trading partners list is due to Singapore being an extremely high exporter to Hong Kong, with relatively very low imports. On the other hand Taiwan is the opposite, where the import trade values consistently exceeds the export trade values.\r\nFrom the Trade Totals table, it can be seen that Singapore experienced trade surpluses with Hong Kong and Mainland China, and trade deficits with Japan, Malaysia and Taiwan, in both 2019 and 2020. Singapore experienced a trade deficit in 2019, however turning it around to a trade surplus in 2020. Overall, Singapore remained a net exporter over the 2-year period, with a trade surplus of ~S$52.7 billion.\r\nThank you for reading, we hope you have learnt something new and enjoyed the process!\r\nRyan\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T17:17:46+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
