[
  {
    "path": "posts/2021-06-20-dataviz-makeover-2/",
    "title": "DataViz Makeover 2 - Singapore Top Trading Partners, 2011-2020",
    "description": "A data visualization makeover and a Tableau tutorial for beginners.",
    "author": [
      {
        "name": "Ryan Chan",
        "url": "https://www.linkedin.com/in/ryan-chan-a7021b5/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n1.0 ORIGINAL VISUALIZATION\r\n\r\nThe above chart shows a visualization depicting merchandising trade of Singapore’s trading partners from 2011-2020. The visualization comes from the Department of Statistics Singapore International Trade infographic page at https://www.singstat.gov.sg/modules/infographics/singapore-international-trade, and the dataset can be downloaded from the under the sub-section of Merchandise Trade by Region/Market section under ‘Download all in Excel’.\r\nBefore we analyse the visualization, it is important to gain a clear understanding of the context of the visualization and the data it represents.\r\nData represents Singapore’s trade values (Exports and Imports) with its top 10 trading partners, in year 2020.\r\nVisualization utilizes a scatterplot chart as the foundation, with export value on the X-axis and import value on the Y-axis. The size of each bubble / point indicates the total trade volume.\r\n2.0 CRITIQUE OF VISUALIZATION\r\n2.1 Clarity\r\nUsing sized bubbles as the data points for a scatterplot chart makes it very hard for the user to accurately identify the exact origin point, any user who wants to estimate the export and import values will find it hard to do so. Furthermore, what is the point of assigning the total trade volume to size of the bubble, when it is intuitively clear that any point nearer to the top right of the chart will be huge and points nearer to the bottom left will be small?\r\nThe chart only states the total trade amount for each trading partner, there is no clear labelling or indication of the exact export and import values.\r\nWhen mouse is hovered over a trading partner, that corresponding bubble selection will move to be on the front most panel, and potentially obscure the other bubbles and their trade amounts. This is not friendly to a user who would like to compare two partners’ trade amounts.\r\n2.2 Aesthetics\r\nThe size of each bubble is too huge and unnecessary, and only serves to contribute to the obscuring problem mentioned above.\r\nThere is a default overlay position where if left untouched some bubbles are always on top of other bubbles. However, when a mouse is hovered over a particular bubble the bubble will come to the front, only for it disappear to the back again once the mouse has left the bubble. This can be an eyesore for a user who is having to move his / her mouse around the chart and constantly seeing bubbles ‘popping’ and ‘disappearing’ in quick fashion.\r\nThe use of colours seem to be arbitrary in this chart, there is no clear function that each colours serves except to differentiate each country. This is never good practice, to implement a functionality that does not help the user in any way in his / her analysis of the data.\r\n3.0 Proposed Alternative Design\r\n\r\nTwo charts are introduced.\r\nThe chart on the left retains the foundation build of the original visualization, with several tweaks.\r\nIt is still a scatterplot with each dot representing the export and import values for each trading partner.\r\nThe size function from the original visualization are discarded, so the chart will not be so convoluted.\r\nA 45-degree reference line is created such that any point above the line is a Net Importer and any point below the line is a Net Exporter.\r\nTwo colours are introduced, green for partners that are net exporters and red for partners that are net importers.\r\nTooltips will include useful information such as total trade volume, whether partner is a net exporter or importer, net (export / import) trade value and export / import values.\r\n\r\nThe chart on the right is a combination of bar charts.\r\nEach row on the chart represents a trading partner.\r\nFor each row, the partner’s import value will be shown as a reversed horizontal bar on the left, and export value as a normal horizontal bar on the right.\r\nWithin the bars of each row, a corresponding net trade value will be shown (i.e. if partner is a net exporter, a smaller bar representing the net export trade value will appear within the export bar with a label to indicate the net trade value)\r\nNet exporters will have their export bars highlighted in green, while net importers will have their import bars highlighted in red.\r\nTooltips will include useful information such as total trade volume, whether partner is a net exporter or importer, their net exporter / importer rank, net (export / import) trade value and export / import values.\r\n\r\nSeveral controls will be utilized for the user to interact with the visualization\r\nA year slider will allow user to scroll through the data by year\r\nA country filter will allow user to select only specific partners he / she wants to see, or to exclude certain specific partners\r\n‘Top N Partners’ allows typed-in integers that will limit both charts to showing a limited amount of countries, based on the selected ranking type\r\n‘Rank By’ is a parameter allowing user to select Top N Partners based on the following rank types: Total Trade, Net Exporter and Net Importer. This function will also change the order of partners that the right chart displays, with the highest value partner on top.\r\n\r\n4.0 DATA PREPARATION\r\nThe data was first cleaned and prepared using Tableau Prep Builder and then loaded into and visualized using Tableau.\r\n4.1 Importing Data\r\nCreate a connection to the data source.\r\nDrag the tables (T1 and T2) to edit into the canvas to start their respective flows. From this point onwards, both tables shall be handled in the same manner until the moment they are joined.\r\nTick the ‘Use Data Interpreter’ check box.\r\n\r\nTableau’s Data Interpreter will try its best to figure out the underlying table structure in each worksheet. The result of cleaning with Data Interpreter are as follows:\r\nOriginal\r\n\r\nAfter Data Interpreter is Used\r\n\r\n4.2 Pivoting Data\r\nClick on the ‘+’ sign beside the table and select ‘Pivot’\r\nOn the left panel, select all fields except ‘Subject: Merchandise Trade’ and drag them to the ‘Pivoted Fields’ pane.\r\n\r\nAfter pivoting the relevant fields, add another step to ‘clean’ data.\r\n\r\n4.3 Cleaning Data\r\nRename the fields accordingly\r\nCreate a calculated field to derive the actual value of each row\r\n\r\nUse the filter function to exclude continents\r\n\r\nConvert the ‘Year Month’ field into a date time format\r\n\r\nFilter for the time period we want.\r\n\r\n4.4 Joining Tables\r\nAdd a new step to join the two cleaned tables.\r\nUnder settings, apply two join clauses: Period and Country. Change the join type to ‘Right’ (i.e. ensure the entire ‘Clean 1’ circle is shaded in the venn diagram. Output should be a total of 13,320 values.\r\nRemove duplicated fields\r\n\r\nFor both Export and Import values, use the function ZN() to convert null values to 0.\r\n\r\nCreate an aggregate step.\r\nDrag ‘Period’ and ‘Country’ to the Grouped Fields, and ‘Export’ and ‘Import’ to the Aggregated Fields.\r\n\r\n\r\nb. Under the Period field in the Grouped Fields, convert dates to year number\r\n\r\nc. In the top left hand corner of the Period field, click the icon and change the data type to ‘Date’.\r\n\r\n4.5 Run Output Flow\r\nAdd an Output step and click ‘Run Flow’ to save the data as a Tableau Data Extract (.hyper)\r\n\r\n5. DATA MAKEOVER WITH TABLEAU\r\n5.1 Preparation\r\n5.1.1 Importing Data into Tableau\r\nLaunch Tableau Desktop, and under the ‘Connect To a File’ section select ‘More’. Navigate to the Tableau Data Extract file we have just saved.\r\n\r\nResult of the connection. Rename ‘Sheet 1’ to ‘Scatterplot’. Navigate to ‘Scatterplot’ to begin makeover.\r\n\r\n5.1.2 Create Calculated Fields / Parameters\r\nBefore we begin creating the visualizations proper, we will need to create several calculated fields and parameters that will help us with generating the visuals we want. Follow the formulas below to create the new fields / parameters\r\nParameters\r\nTo create a parameter, right-click on the tables pane and click ‘Create Parameter’. Enter the settings as per the screenshots.\r\n\r\nRank By Parameter\r\n\r\nTop N Partners\r\n\r\nCalculated Fields\r\nTo create a calculated field, right-click on the tables pane and click ‘Create Calculated Field’. Enter the formulas as per the screenshots.\r\nTrade Volume\r\n\r\nTrade Rank\r\n\r\nNet Trade Value\r\n\r\nNet Trade Import\r\n\r\nNet Trade Import (Binary)\r\n\r\nNet Trade Export\r\n\r\nNet Trade Export (Binary)\r\n\r\nNet Importer Rank\r\n\r\nNet Exporter Rank\r\n\r\nSorting\r\n\r\nNet Importer\r\n\r\nNet Exporter\r\n\r\nImport (Name)\r\n\r\nExport (Name)\r\n\r\n5.2 Makeover Original Visualization\r\nDrag the following measures and dimensions into the following locations:\r\nExport to Columns\r\nImport to Columns, then Export to Columns\r\nCountry to Detail Mark\r\n\r\n\r\nFor each of the highlighted axis in the previous screenshot (Import Y-axis and Export X-axis), right-click on the axis and select ‘Edit Axis’. Select ‘Fixed’ Range and key in the range start and end as per the screenshot below.\r\n\r\nRight-click on the Export Y-axis and select ‘Dual Axis’ option. Result should look like this:\r\n\r\nRemove ‘Measure Names’ from the Color Mark, and right-click on the Export Y-axis and select ‘Synchronise Axis’, and then uncheck the ‘Show Header’ button. You should see a 45-degree diagonal line of data points (see below). Under the Marks for SUM(Export), edit the size and colour of the data points, making the size the smallest, and setting the colours to transparent.\r\n\r\nRight-click anywhere in the chart area and navigate to ‘Trend Lines’, then ‘Show Trend Lines’, then select ‘SUM(Export)’. Result should look like this:\r\n\r\nDrag ‘Period’ to Filter and select filter by ‘Year’. When the filter settings page open up, select ‘Use all’ under the ‘General’ tab and click ok. Right-click on the ‘YEAR’ filter and navigate to Apply to Worksheets, and select ‘All Using This Data Source’.\r\n\r\nDrag ‘Country’ to Filter. When the filter settings page open up, navigate to the ‘Top’ tab and enter the settings as follows:\r\n\r\nUnder the ‘SUM(Import)’ Marks group, drag the following fields into the ‘Tooltip’ box:\r\n\r\nUnder the ‘SUM(Import)’ Marks group, change mark type to ‘Circle’, drag ‘Country’ to ‘Label’ and drag ‘Net Trade (Value)’ to ‘Color’. Under the colour legend settings adjust the settings as per the screenshot (see below). Subsequently, hide the colour legend card.\r\n\r\nClick on the ‘Tooltip’ under the ‘SUM(Import)’ Marks and enter the following message into the tooltip:\r\n\r\nChange the chart title to ‘Trade Volume by Exports / Imports’. Our first chart is completed. End Result should look like this:\r\n\r\n5.3 Create Trade Rankings Bar Chart\r\nCreate a new worksheet and rename it to ‘Bar’. Drag the following measures and dimensions to the following locations:\r\nImport, Net Trade (Import), Export, Net Trade (Export) into Columns in this order\r\nCountry into Rows\r\nNote: Filters should already automatically appear as we set filter in previous worksheet to apply to all charts using the same data source.\r\n\r\nFor each of the Net Trade measure (Import and Export), right-click on the measure and select ‘Dual Axis’ option.\r\n\r\nResult should look like the screenshot below. Right-click on Net Trade (Import and Export) axes and select ‘Synchronize Axis’, then uncheck ‘Show Header’.\r\n\r\nRight-click on the Import and Export Axes and click ‘Edit Axis’. Select ‘Fixed’ Range and key in the range start and end as per the screenshot below.\r\nFor IMPORT AXIS ONLY, check the ‘Reversed’ option under scale.\r\n\r\n\r\nUnder each of the Net Trade (Import and Export) marks, click on the size option and reduce the size of the bars, until about half the size of the Import / Export bars. Result should look something like the screenshot below. Once complete, under the ‘All’ Marks section remove measure names from the color mark.\r\n\r\nAdd the following measures and dimensions into the following Mark groups:\r\n‘All’ Mark Group\r\n\r\n\r\nb.  ‘Import’ Mark Group\r\n\r\nc.  ‘Net Trade (Import)’ Mark Group. Additionally, click on the color button and adjust the colour to the following settings:\r\n\r\nd.  ‘Export’ Mark Group\r\n\r\ne.  ‘Net Trade (Export)’ Mark Group. Additionally, click on the color button and adjust the colour to the following settings:\r\n\r\nThe result should look like the below screenshot. Click on the color legend options to edit the colours.\r\n\r\nAt the colour legend settings page, adjust the Import and Export bars’ colours to the following settings:\r\n\r\nAt the ‘Export’ and ‘Import’ Mark Groups, click on colour and set the opacity to 35%.\r\n\r\nUnder the ‘All’ Marks Group, click ‘Tooltip’ and enter the following message into the tooltip:\r\n\r\nRight-click on the all the existing parameters (Rank By, Top N Partners) and filters (YEAR, Country) in the filter and parameter panes, and click ‘Show Parameter’ / ‘Show Filter’.\r\nOn the YEAR filter, navigate to the dropdown options and select ‘Single Value (slider)’\r\nOn the Country filter, navigate to the dropdown options and select ‘Multiple Values (dropdown)’\r\nOn the Top N Partners parameter, navigate to the dropdown options and select ‘Type In’\r\n\r\n\r\nRight-click on Country and select ‘Sort’. Enter the sort settings as follows using ‘Sorting’ as the field name.\r\n\r\nChange the chart title to ‘Trading Rankings’. Our second chart is completed. End result should look like this:\r\n\r\n5.4 Create Dashboard and Combine Charts\r\nIn the pages tab at the bottom of the window, click ‘New Dashboard’ icon to open up a new dashboard.\r\n\r\nUnder the ‘Size’ options, select ‘Fixed Size’ and adjust size to ‘1366 x 768’.\r\n\r\nDrag and drop both the ‘Bar’ and ‘Scatterplot’ sheets into the dashboard, with the ‘Bar’ sheet on the right and ‘Scatterplot’ sheet on the left. From the Objects shelf on the bottom left corner, drag a text object and place it at the top of both charts. Give the chart a title and short description. The result should look something like this:\r\n\r\nVoila! We have created our first dashboard! Visit this link to access the dashboard on Tableau Public: https://public.tableau.com/app/profile/ryan.chan8444/viz/DataVizMakeover2_16241161747500/Dashboard1\r\n6. MAJOR OBSERVATIONS\r\nFrom 2011 to 2012, Malaysia was Singapore’s top trading partner, with total trade volumes of S$113 billion and S$115 billion respectively. However, from 2013 onwards, we see that Mainland China took over the top spot as Singapore’s top trading partner, growing from a trade volume of S$116 billion to a record high of S$137 billion in 2019, before dipping slightly to S$136 billion in 2020.\r\n\r\nInterestingly, over the last 10 years Hong Kong has been consistently a top importer of Singapore’s goods and services. Singapore has managed to maintain a steady trade surplus of between S$50-60 billion during this period, never once falling outside this range.\r\n\r\nSingapore has consistently been a high importer of goods and services from Taiwan, Saudi Arabia and United States. In the last 10 years, these 3 countries have managed to be in the Top 5 Net Importer rankings in all but one year (Taiwan in 2011, Saudi Arabia in 2019 and United States in 2020). According to World Integrated Trade Solution and World’s Richest Countries, the largest category of imported goods from each country are:\r\nUnited States - Machinery and Electrical\r\nSaudi Arabia - Fuels\r\nTaiwan - Electronic Equipment\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-21T00:36:30+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1 - Singapore International Trade",
    "description": "A data visualization makeover and a Tableau tutorial for beginners.",
    "author": [
      {
        "name": "Ryan Chan",
        "url": "https://www.linkedin.com/in/ryan-chan-a7021b5/"
      }
    ],
    "date": "2021-05-29",
    "categories": [],
    "contents": "\r\n1.0 ORIGINAL VISUALIZATION\r\n The above chart shows a visualization depicting merchandising trade of the top six trading countries from 2019-2020. The data is available at https://www.singstat.gov.sg/find-data/search-by-theme/trade-and-investment/merchandise-trade/latest-data, and can be downloaded from the Merchandise Trade by Region/Market section under ‘Download all in Excel’.\r\nBefore we analyse the visualization, it is important to gain a clear understanding of the context of the visualization and the data it represents.\r\nData is meant to represent Singapore’s trade values (Exports and Imports) with its top six trading partners\r\nVisualization is indicated by the title to be from 2019 to 2020\r\nBoth the visualization and underlying data source do not indicate the currency in which these trade values are published, hence for the purposes of this project we shall make the assumption of values being in Singapore dollars, reasonable given that the data comes from a government agency\r\n2.0 CRITIQUE OF VISUALIZATION\r\n2.1 Clarity\r\nThe chart title is not very clear; a first-time reader might misidentify the visualization to be about the total value of international trade that each of the countries conducted, and that these six countries represent the top six countries in the world in terms of trade value. Instead the data is referring to value of trade each country conducts with Singapore, and that these countries represent Singapore’s top six trading partners.\r\nThe title states that the period of data the visualization is meant to display is from 2019 to 2020. That itself is not clear; should we take it to mean from Jan 2019 to Jan 2020, or perhaps Jan 2019 to Dec 2020? For this project however, we shall assume a consistent period range of Jan 2019 to Dec 2020 for all values.\r\nFurthermore, the horizontal axes of the six charts have different ranges, with Japan seemingly having a range that only covers 2020.\r\n\r\nThe vertical axes for the six charts are all in different ranges, making it hard to compare between countries.\r\nThe visualization intends to depict trade values over months, but using an area-type chart which makes it hard to tell the values of each month, and identify which months have specific trends (e.g. spikes, troughs).\r\nThe chart does not explicitly state the denomination of the values shown, and readers might be misled into thinking that the trade volumes range from a few hundred thousand to a few million. Yet, upon closer inspection of the underlying data source, the values are actually given in denominations of thousands ($000s) and actual trade volumes range from a few hundred million to billions.\r\n2.2 Aesthetics\r\nThe width size of each chart are different from each other, making the visual not aesthetically balanced.\r\nThe positioning of the charts does not make it easy for country-to-country comparison – they are too far apart and having 3 countries on top and 3 countries below is not ideal for comparison.\r\nThe use of overlapping area charts with the orange import overlaid on the blue export values makes it not too pleasing on the eyes, it might take reader’s eyes a while to adjust to finding the blue values especially when they are ‘hidden’ behind the orange area.\r\n3.0 PROPOSED ALTERNATIVE DESIGN\r\n\r\n3.1 Advantages of New Design\r\nTitle changed to better reflect the objective and period range of the visualization. Subtitle added to include a short summary of key findings.\r\nChart type changed to bar chart, to enable ease of month-to-month comparisons.\r\nSeparated export and import trade values, with import values displayed in a reverse (upside-down) manner, to enable easier-on-the-eye comparison between the magnitudes of export and import volumes.\r\nTo ease country-to-country comparison, certain changes were made:\r\nCharts are placed side by side each other on the same level\r\nHorizontal axes and chart width were standardized\r\nVertical axes standardized to 0 to 8 billion\r\n\r\nFor each chart (export and import), categorise values into two types – if an export / import value is higher than its export / import counterpart in the same month, that value will contain a darker shade of the colour scheme used. This enables reader to easily identify in which months Singapore had more net exports or imports for each of their trading partners.\r\nIncluded additional information on trade totals:\r\nAggregated totals of export and import trade volumes in the period range\r\nCalculated export and import differences to find out whether Singapore has trading surpluses or deficits with each trading partner\r\n\r\n4.0 DATA PREPARATION\r\nThe data was first cleaned and prepared using Tableau Prep Builder and then loaded into and visualized using Tableau.\r\n4.1 Importing Data\r\nCreate a connection to the data source.\r\nDrag the tables (T1 and T2) to edit into the canvas to start their respective flows. From this point onwards, both tables shall be handled in the same manner until the moment they are joined.\r\nTick the ‘Use Data Interpreter’ check box.\r\n\r\nTableau’s Data Interpreter will try its best to figure out the underlying table structure in each worksheet. The result of cleaning with Data Interpreter are as follows:\r\nOriginal\r\n\r\nAfter Data Interpreter is Used\r\n\r\n4.2 Pivoting Data\r\nClick on the ‘+’ sign beside the table and select ‘Pivot’\r\nOn the left panel, select all fields except ‘Subject: Merchandise Trade’ and drag them to the ‘Pivoted Fields’ pane.\r\n\r\nAfter pivoting the relevant fields, add another step to ‘clean’ data.\r\n\r\n4.3 Cleaning Data\r\nRename the fields accordingly\r\nCreate a calculated field to derive the actual value of each row\r\n\r\nFilter for the six countries we want\r\n\r\nConvert the ‘Year Month’ field into a date time format\r\n\r\nFilter for the time period we want.\r\n\r\n4.4 Joining Data\r\nAdd a new step to join the two cleaned tables.\r\nUnder settings, apply two join clauses: Period and Country. Output should be a total of 144 resulting rows.\r\n\r\nCreate an additional clean step.\r\nRemove duplicated fields\r\nCreate 2 additional fields to indicate if i) Exports > Imports and ii) Imports > Exports (this will be used to supplement the visualization in Tableau later on)\r\n\r\n\r\n4.5 Run Output Flow\r\nAdd an Output step and click ‘Run Flow’ to save the data as a Tableau Data Extract (.hyper)\r\n\r\n5.0 DATA MAKEOVER WITH TABLEAU\r\n5.1 Makeover Original Chart\r\n5.1.1 Importing Data into Tableau\r\nLaunch Tableau Desktop, and under the ‘Connect To a File’ section select ‘More’. Navigate to the Tableau Data Extract file we have just saved.\r\n\r\nRename ‘Sheet 1’ to ‘Main’. Navigate to ‘Main’ to begin makeover. Result of the connection will look like this:\r\n\r\n5.1.2 Create Chart\r\nDrag ‘Country’ and ‘Period’ into ‘Columns’ shelf. Click on the dropdown arrow on the ‘Period’ icon and select the second ‘Month’ option to drill down the period display into months.\r\n\r\nDrag the ‘Export’ and ‘Import’ measures into the ‘Rows’ shelf. The default chart displayed is a line chart. Under the ‘All’ section in the ‘Marks’ shelf, select the dropdown menu to change chart type to ‘Bar’.\r\n\r\nFor both Import and Export axes, right-click on each axis and perform the following actions:\r\nSet fixed range – Fixed Start: 0, Fixed End: 8,000,000,000\r\nRename Axis Title – Export / Import ($SGD)\r\nFor Import Axis only: Check the ‘Reversed’ box\r\n\r\n\r\n5.1.3 Colourize Chart\r\nUnder the ‘SUM(Export)’ mark, drag the ‘Export > Import?’ measure into the ‘Color’ box, repeat the steps for the ‘SUM(Import)’ mark using the ‘Import > Export?’ measure.\r\n\r\nUnder the colour legend, click the dropdown arrow and select ‘Edit Colors’.\r\n\r\nIn the ‘Edit Colors’ settings, we will edit the colours of the bars.\r\nFor the Import data, we will use the orange colour scheme, with a darker shade to represent months where imports exceed exports, and a lighter shade to represent months where the imports are less than exports.\r\nFor the Export data, we will use the green colour scheme, with a darker shade to represent months where exports exceed imports, and a lighter shade to represent months where the exports are less than imports.\r\n\r\nThe result will look something like this:\r\n\r\n5.1.4 Edit Title\r\nChange the title and add subtitle to better reflect the summary and objectives of the visualization\r\n\r\n5.2 Create Totals Table\r\nWe will now create a table to display Singapore’s total trade volumes with each of their trading partners over the selected period.\r\n5.2.1 Create new sheet and new calculated field\r\nCreate new sheet and rename to ‘Totals’.\r\nIn the ‘Tables’ section right-click and select ‘Create Calculated Field’. Create a new calculation showing the difference between Export and Import (i.e. Export-Import).\r\n\r\n5.2.2 Select Relevant Data to Display\r\nDrag ‘Country’ and ‘Period’ into ‘Columns’ shelf.\r\nDrag ‘Measure Values’ into the ‘Text’ box under the ‘Marks’ shelf.\r\nClick on the dropdown arrow of each of the ‘Measure Values’ and format number to show the currency and numbers in Billions with 1 decimal place.\r\n\r\nDrag ‘Measure Names’ into the ‘Rows’ shelf.\r\nDelete ‘CNT(Extract)’ from the ‘Measure Values’ shelf.\r\nDrag ‘Measure Values’ into the ‘Color’ box under the ‘Marks’ shelf.\r\nUnder the ‘Analysis’ toolbar, navigate to ‘Totals’ and select ‘Show Row Grand Totals’.\r\nRearrange the values so that ‘SUM(Difference)’ is at the bottom. Result will look like this:\r\n\r\n5.2.3 Editing the Colour scheme for table data\r\nClick on the dropdown arrow of ‘Measure Values’ with the colour icon, and select ‘Use Separate Legends’.\r\n\r\nUnder the colour legend on the right-hand side of the window, click the dropdown arrow of ‘SUM(Export)’ and select ‘Edit Colors’. In the ‘Edit Colors’ settings, we will edit the colours for the Export and Import values.\r\nSelect ‘Custom Diverging’ from the ‘Palette’ dropdown list. Check the ‘Stepped Color’ option and change to 2 steps. Change both colours on the left and right side of the palette to black. Check ‘Include Totals’ box. Click ‘Apply’ and then ‘OK’. Click the dropdown arrow for ‘SUM(Exports)’ colour legend and select ‘Hide Card’.\r\nRepeat steps for ‘SUM(Import)’ colour legend.\r\n\r\nUnder the colour legend on the right-hand side of the window, click the dropdown arrow of ‘SUM(Differences)’ and select ‘Edit Colors’. In the ‘Edit Colors’ settings, we will edit the colours for the Difference values.\r\nSelect ‘Custom Diverging’ from the ‘Palette’ dropdown list. Check the ‘Stepped Color’ option and change to 2 steps. Change the left side to red and the right side to green. Click ‘Advanced’ option and tick the ‘Center’ box and type in 0. Check ‘Include Totals’ box. Click ‘Apply’ and then ‘OK’. Click the dropdown arrow for ‘SUM(Difference)’ colour legend and select ‘Hide Card’.\r\n\r\nRename table to ‘Trade Totals’. Result table will look like this:\r\n\r\nRight-click anywhere on the canvas and click ‘caption’. A caption should appear at the bottom of the canvas. Double-click on the caption window and edit the caption to show the source of data.\r\n\r\n5.3 Create Dashboard and Combine Charts\r\nIn the pages tab at the bottom of the window, click ‘New Dashboard’ icon to open up a new dashboard.\r\n\r\nUnder the ‘Size’ options, select ‘Automatic’.\r\n\r\nDrag and drop both the ‘Main’ and ‘Totals’ sheet into the windows, with the ‘Main’ sheet above and ‘Totals’ sheet below. Right-click on any blank space in the ‘Trade Totals’ sheet and select the ‘Caption’ option. Realign the data tables from both sheets accordingly so they align together nicely. The result should look something like this:\r\n\r\nVoila! We have created our first dashboard! Visit this link to access the dashboard on Tableau Public: Tableau Public Dashboard\r\nMajor Observations\r\n\r\nOver the selected period, we can observe that, except for a few months, we can see a relatively clear trend of Mainland China consistently ranking as Singapore’s top trading partner in terms of trade volumes for both exports and imports.\r\nHong Kong’s entry into the top six trading partners list is due to Singapore being an extremely high exporter to Hong Kong, with relatively very low imports. On the other hand Taiwan is the opposite, where the import trade values consistently exceeds the export trade values.\r\nFrom the Trade Totals table, it can be seen that Singapore experienced trade surpluses with Hong Kong and Mainland China, and trade deficits with Japan, Malaysia and Taiwan, in both 2019 and 2020. Singapore experienced a trade deficit in 2019, however turning it around to a trade surplus in 2020. Overall, Singapore remained a net exporter over the 2-year period, with a trade surplus of ~S$52.7 billion.\r\nThank you for reading, we hope you have learnt something new and enjoyed the process!\r\nRyan\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T17:17:46+08:00",
    "input_file": {}
  }
]
